#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_string.resource_code: Refreshing state... [id=bw9dsvtg]
azuread_user.IT-2: Refreshing state... [id=ec6c73b7-5715-40a4-bbfe-bbde8304bb17]
azuread_user.IT-1: Refreshing state... [id=673121ae-cd46-4bb4-bcb8-8d7c65937e56]
azuread_user.IT-3: Refreshing state... [id=429dbc0e-ae7f-4389-81d1-5a35e970247d]
azuread_directory_role.GlobalAdmin: Refreshing state... [id=46131aa8-74dc-45bc-897c-43457932adf3]
azuread_user.AF-5: Refreshing state... [id=0ab12dd1-8877-4647-9cea-18478e655c02]
azuread_user.AF-4: Refreshing state... [id=fe0ca8af-ab96-421e-bf41-cacdaaa2d6b8]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.RG_CPE: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04OGI4OWY4Yi1mZmM2LTRkN2EtOGQ2ZS0xZTU5MzM4YzY4NDQ7b2JqZWN0SWQ9ZjFiMmEwYzAtNjMyMS00OThmLWI4NTktNjhiNmY4OWYyMzRiO3N1YnNjcmlwdGlvbklkPTc3YmIwYjA3LTU3ZTUtNDRiNS1hMzUwLTMxMGE5MzkxNzI5ODt0ZW5hbnRJZD1jZTQ3NzVkMy0xYzJlLTQ2NDQtYjJiYy02MzFjMTU3ZDJiZTc=]
azurerm_virtual_network.CondidentialServices-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1]
azurerm_storage_account.ConfidentielStorageAccount: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Storage/storageAccounts/confidentielbw9dsvtg]
azurerm_network_security_group.JumpStationSecurityGroup: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup]
azurerm_virtual_network.System-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1]
azurerm_key_vault.KeyVault1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.KeyVault/vaults/KeyVaultbw9dsvtg]
azurerm_public_ip.PublicIP-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/publicIPAddresses/PublicIP-1]
azurerm_recovery_services_vault.ConfidentialRecoveryVault: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.RecoveryServices/vaults/ConfidentialRecoveryVault]
azurerm_subnet.CondidentialServices-network-1-subnet-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1/subnets/CondidentialServices-network-1-subnet-1]
azuread_group.IT: Refreshing state... [id=f3761577-c296-420a-802d-20c0c8333803]
azuread_group.AF: Refreshing state... [id=a60d58c8-e955-4a2c-9c94-630793006707]
azurerm_subnet.System-network-1-subnet-2: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-2]
azurerm_virtual_network_peering.SystemToConfidentialServices: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/virtualNetworkPeerings/SystemToConfidentialServices]
azurerm_virtual_network_peering.ConfidentialServicesToSystem: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1/virtualNetworkPeerings/ConfidentialServicesToSystem]
azurerm_subnet.System-network-1-subnet-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-1]
azurerm_network_security_rule.JumpStationSecurityRule-3: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup/securityRules/Allow_traffic_to_internal_network]
azurerm_network_security_rule.JumpStationSecurityRule-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup/securityRules/Allow_traffic_to_internet]
azurerm_network_security_rule.JumpStationSecurityRule-2: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup/securityRules/Allow_only_RDP_traffic_from_CPE_network]
azurerm_network_interface.ProductionVM1-NIC: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/ProductionVM1-NIC]
azurerm_network_interface.JumpStationVM1-NIC: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/JumpStationVM1-NIC]
azuread_directory_role_assignment.GlobalAdmin: Refreshing state... [id=lAPpYvVpN0KRkAEhdxReEHcVdvOWwgpCgC0gwMgzOAM-1]
azuread_conditional_access_policy.AdminAccessPolicy: Refreshing state... [id=779c4ca8-1bd1-41b9-bec5-9c536d7e5af7]
azurerm_virtual_machine.ProductionVM1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/ProductionVM1]
azurerm_virtual_machine.JumpStationVM1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/JumpStationVM1]
azurerm_backup_policy_vm.ProductionVM1-backup-policy: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.RecoveryServices/vaults/ConfidentialRecoveryVault/backupPolicies/ProductionVM1-backup-policy]
azurerm_storage_share.CondidentialServices-share-1: Refreshing state... [id=https://confidentielbw9dsvtg.file.core.windows.net/confidentiel]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_key_vault.KeyVault1 will be updated in-place
  ~ resource "azurerm_key_vault" "KeyVault1" {
      ~ access_policy                   = [
          ~ {
              ~ object_id               = "7fb8f882-65e7-4d0c-a742-57b18bd8895d" -> "f1b2a0c0-6321-498f-b859-68b6f89f234b"
                # (6 unchanged attributes hidden)
            },
        ]
        id                              = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.KeyVault/vaults/KeyVaultbw9dsvtg"
        name                            = "KeyVaultbw9dsvtg"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_virtual_machine.JumpStationVM1 must be replaced
-/+ resource "azurerm_virtual_machine" "JumpStationVM1" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/JumpStationVM1" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "JumpStationVM1"
        tags                             = {
            "environment" = "System"
        }
      - zones                            = [] -> null
        # (6 unchanged attributes hidden)

      - os_profile { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + os_profile { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ storage_os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/disks/osdisk1" -> (known after apply)
            name                      = "osdisk1"
          ~ os_type                   = "Windows" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.ProductionVM1 must be replaced
-/+ resource "azurerm_virtual_machine" "ProductionVM1" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/ProductionVM1" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "ProductionVM1"
        tags                             = {
            "environment" = "System"
        }
      - zones                            = [] -> null
        # (6 unchanged attributes hidden)

      - os_profile { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + os_profile { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ storage_os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/disks/osdisk2" -> (known after apply)
            name                      = "osdisk2"
          ~ os_type                   = "Windows" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @AxFrancois, Action: `pull_request`, Workflow: `Terraform Plan`*